uhnp/src/InformationRegisters/НастройкиАналитическихПанелейПользователей/НастройкиАналитическихПанелейПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиАналитическихПанелейПользователей</name>
  <resources>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>ПериодОтчетаНачало</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитическаяПанель</name>
    <type>
      <types>CatalogRef.УдалитьПанелиОтчетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <comment>(-УХПредставлениеСписка)(-УХПредставлениеОбъекта)</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ПроектЭтапа</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДлительностьДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатьяДоходовИРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОсновнаяВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВалютаПлатежей</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_СметнаяСтоимостьБазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_СметнаяСтоимостьТекущая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделИнвестиционнойПрограммы</name>
    <type>
      <types>CatalogRef.РазделыИнвестиционныхПрограмм</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональноеНаправление</name>
    <type>
      <types>CatalogRef.ФункциональныеНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтавкаДисконтирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОцениваетсяПоКритериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьРасчетаАнализаKPI</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельРасчетаПоказателейПроекта</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОтображенияМоделиРасчета</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПроектыПредшественники</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПартнерыИКонтактныеЛица</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПартнера</name>
      <type>
        <types>CatalogRef.РолиПартнеровВСделкахИПроектах</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/НастройкиАналитическихПанелейПользователей/ManagerModule.bsl
// Записывает настройки аналитической панели АналитическаяПанельВход из 
// структуры СтруктураОтборовВход в регистр по пользователю ПользовательВход.
Функция ЗаписатьНастройкуАналитическойПанели(ПользовательВход, АналитическаяПанельВход, СтруктураОтборовВход) Экспорт
	РезультатФункции = Истина;
	Попытка
		НаборЗаписей = РегистрыСведений.НастройкиАналитическихПанелейПользователей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(ПользовательВход); 
		НаборЗаписей.Отбор.АналитическаяПанель.Установить(АналитическаяПанельВход); 
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.АналитическаяПанель	 = АналитическаяПанельВход;
		НоваяЗапись.Пользователь		 = ПользовательВход;
		НоваяЗапись.ПериодОтчета		 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураОтборовВход, "ПериодОтчета", Справочники.Периоды.ПустаяСсылка()); 
		НоваяЗапись.ПериодОтчетаНачало	 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураОтборовВход, "ПериодОтчетаНачало", Справочники.Периоды.ПустаяСсылка()); 
		НоваяЗапись.Организация			 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураОтборовВход, "Организация", Справочники.Организации.ПустаяСсылка()); 
		НоваяЗапись.Сценарий			 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураОтборовВход, "Сценарий", Справочники.Сценарии.ПустаяСсылка()); 
		НоваяЗапись.Валюта				 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураОтборовВход, "Валюта", Справочники.Валюты.ПустаяСсылка()); 
		НоваяЗапись.Проект				 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураОтборовВход, "Проект", Справочники.Проекты.ПустаяСсылка()); 
		НаборЗаписей.Записать(); 
	Исключение
		РезультатФункции = Ложь;
		ТекстСообщения = НСтр("ru = 'Не удалось записть настройку отборов пользователя %Пользователь% для аналитической панели %АналитическаяПанель% по причине: %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Пользователь%", Строка(ПользовательВход));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%АналитическаяПанель%", Строка(АналитическаяПанельВход));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецПопытки;
	Возврат РезультатФункции;
КонецФункции

// Возвращает структуру отборов для панели АналитическаяПанельВход, сохранённых
// в регистре по пользователю ПользовательВход.
Функция СчитатьНастройкиОтборов(ПользовательВход, АналитическаяПанельВход) Экспорт
	РезультатФункции = Новый Структура;
	РезультатФункции = БизнесАнализКлиентСерверУХ.ИнициализироватьСтруктуруОтборовАналитическойПанели();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НастройкиАналитическихПанелейПользователей.Пользователь,
		|	НастройкиАналитическихПанелейПользователей.АналитическаяПанель,
		|	НастройкиАналитическихПанелейПользователей.ПериодОтчета,
		|	НастройкиАналитическихПанелейПользователей.Организация,
		|	НастройкиАналитическихПанелейПользователей.Сценарий,
		|	НастройкиАналитическихПанелейПользователей.Валюта,
		|	НастройкиАналитическихПанелейПользователей.Проект,
		|	НастройкиАналитическихПанелейПользователей.ПериодОтчетаНачало
		|ИЗ
		|	РегистрСведений.НастройкиАналитическихПанелейПользователей КАК НастройкиАналитическихПанелейПользователей
		|ГДЕ
		|	НастройкиАналитическихПанелейПользователей.Пользователь = &Пользователь
		|	И НастройкиАналитическихПанелейПользователей.АналитическаяПанель = &АналитическаяПанель";
	Запрос.УстановитьПараметр("АналитическаяПанель", АналитическаяПанельВход);
	Запрос.УстановитьПараметр("Пользователь", ПользовательВход);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезультатФункции.Вставить("ПериодОтчета",		 ВыборкаДетальныеЗаписи.ПериодОтчета);
		РезультатФункции.Вставить("ПериодОтчетаНачало",	 ВыборкаДетальныеЗаписи.ПериодОтчетаНачало);
		РезультатФункции.Вставить("Организация",		 ВыборкаДетальныеЗаписи.Организация);
		РезультатФункции.Вставить("Сценарий",			 ВыборкаДетальныеЗаписи.Сценарий);
		РезультатФункции.Вставить("Валюта",				 ВыборкаДетальныеЗаписи.Валюта);
		РезультатФункции.Вставить("Проект",				 ВыборкаДетальныеЗаписи.Проект);
	КонецЦикла;
	Возврат РезультатФункции;	
КонецФункции
